llm/mimo_v2_flash/b200/bench/bench_random_mid.log
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model='XiaomiMiMo/MiMo-V2-Flash', served_model_name=None, tokenizer=None, num_prompts=300, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1000, random_output_len=1000, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file='/data/bbuf/kda-pilot/llm/mimo_v2_flash/b200/bench/random_mid.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model='XiaomiMiMo/MiMo-V2-Flash', served_model_name=None, tokenizer=None, num_prompts=300, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1000, random_output_len=1000, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file='/data/bbuf/kda-pilot/llm/mimo_v2_flash/b200/bench/random_mid.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)

#Input tokens: 148474
#Output tokens: 155289
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 32        
Successful requests:                     300       
Benchmark duration (s):                  573.66    
Total input tokens:                      148474    
Total input text tokens:                 148474    
Total input vision tokens:               0         
Total generated tokens:                  155289    
Total generated tokens (retokenized):    154732    
Request throughput (req/s):              0.52      
Input token throughput (tok/s):          258.82    
Output token throughput (tok/s):         270.70    
Peak output token throughput (tok/s):    383.00    
Peak concurrent requests:                36        
Total token throughput (tok/s):          529.52    
Concurrency:                             29.11     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   55672.93  
Median E2E Latency (ms):                 56313.05  
---------------Time to First Token----------------
Mean TTFT (ms):                          896.54    
Median TTFT (ms):                        294.02    
P99 TTFT (ms):                           9560.63   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          106.96    
Median TPOT (ms):                        105.09    
P99 TPOT (ms):                           150.33    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           106.03    
Median ITL (ms):                         102.29    
P95 ITL (ms):                            123.24    
P99 ITL (ms):                            207.69    
Max ITL (ms):                            5127.86   
==================================================